Revit 2026 API

# StairsConstructionMethod Enumeration

---

Represents the construction method of the stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsConstructionMethod
```
```vb
Public Enumeration StairsConstructionMethod
```
```cpp
public enum class StairsConstructionMethod
```
```fsharp
type StairsConstructionMethod
```

| Member name | Value | Description |
| --- | --- | --- |
| Assembled | 0 | The stairs is constructed by assembly method. |
| CastInPlace | 1 | The stairs is constructed by cast-in-place method. |
| Precast | 2 | The stairs is constructed by precast method. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace